OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c926.h
extern __at(0x0114) volatile __LCDD04bits_t LCDD04bits;

#define _LCDD04_SEG00           0x01
#define _LCDD04_SEG01           0x02
#define _LCDD04_SEG02           0x04
#define _LCDD04_SEG03           0x08
#define _LCDD04_SEG04           0x10
#define _LCDD04_SEG05           0x20
#define _LCDD04_SEG06           0x40
#define _LCDD04_SEG07           0x80

//==============================================================================


//==============================================================================
//        LCDD05 Bits

extern __at(0x0115) __sfr LCDD05;

typedef struct
  {
  unsigned SEG08                : 1;
  unsigned SEG09                : 1;
  unsigned SEG10                : 1;
  unsigned SEG11                : 1;
  unsigned SEG12                : 1;
  unsigned SEG13                : 1;
  unsigned SEG14                : 1;
  unsigned SEG15                : 1;
  } __LCDD05bits_t;

extern __at(0x0115) volatile __LCDD05bits_t LCDD05bits;

#define _LCDD05_SEG08           0x01
#define _LCDD05_SEG09           0x02
#define _LCDD05_SEG10           0x04
#define _LCDD05_SEG11           0x08
#define _LCDD05_SEG12           0x10
#define _LCDD05_SEG13           0x20
#define _LCDD05_SEG14           0x40
#define _LCDD05_SEG15           0x80

//==============================================================================


//==============================================================================
//        LCDD06 Bits

extern __at(0x0116) __sfr LCDD06;

typedef struct
  {
  unsigned SEG16                : 1;
  unsigned SEG17                : 1;
  unsigned SEG18                : 1;
  unsigned SEG19                : 1;
  unsigned SEG20                : 1;
  unsigned SEG21                : 1;
  unsigned SEG22                : 1;
  unsigned SEG23                : 1;
  } __LCDD06bits_t;

extern __at(0x0116) volatile __LCDD06bits_t LCDD06bits;

#define _LCDD06_SEG16           0x01
#define _LCDD06_SEG17           0x02
#define _LCDD06_SEG18           0x04
#define _LCDD06_SEG19           0x08
#define _LCDD06_SEG20           0x10
#define _LCDD06_SEG21           0x20
#define _LCDD06_SEG22           0x40
#define _LCDD06_SEG23           0x80

//==============================================================================


//==============================================================================
//        LCDD07 Bits

extern __at(0x0117) __sfr LCDD07;

typedef struct
  {
  unsigned SEG24                : 1;
  unsigned SEG25                : 1;
  unsigned SEG26                : 1;
  unsigned SEG27                : 1;
  unsigned SEG28                : 1;
  unsigned SEG29                : 1;
  unsigned SEG30                : 1;
  unsigned SEG31                : 1;
  } __LCDD07bits_t;

extern __at(0x0117) volatile __LCDD07bits_t LCDD07bits;

#define _LCDD07_SEG24           0x01
#define _LCDD07_SEG25           0x02
#define _LCDD07_SEG26           0x04
#define _LCDD07_SEG27           0x08
#define _LCDD07_SEG28           0x10
#define _LCDD07_SEG29           0x20
#define _LCDD07_SEG30           0x40
#define _LCDD07_SEG31           0x80

//==============================================================================


//==============================================================================
//        LCDD08 Bits

extern __at(0x0118) __sfr LCDD08;

typedef struct
  {
  unsigned SEG00                : 1;
  unsigned SEG01                : 1;
  unsigned SEG02                : 1;
  unsigned SEG03                : 1;
  unsigned SEG04                : 1;
  unsigned SEG05                : 1;
  unsigned SEG06                : 1;
  unsigned SEG07                : 1;
  } __LCDD08bits_t;

extern __at(0x0118) volatile __LCDD08bits_t LCDD08bits;

#define _LCDD08_SEG00           0x01
#define _LCDD08_SEG01           0x02
#define _LCDD08_SEG02           0x04
#define _LCDD08_SEG03           0x08
#define _LCDD08_SEG04           0x10
#define _LCDD08_SEG05           0x20
#define _LCDD08_SEG06           0x40
#define _LCDD08_SEG07           0x80

//==============================================================================


//==============================================================================
//        LCDD09 Bits

extern __at(0x0119) __sfr LCDD09;

typedef struct
  {
  unsigned SEG08                : 1;
  unsigned SEG09                : 1;
  unsigned SEG10                : 1;
  unsigned SEG11                : 1;
  unsigned SEG12                : 1;
  unsigned SEG13                : 1;
  unsigned SEG14                : 1;
  unsigned SEG15                : 1;
  } __LCDD09bits_t;

extern __at(0x0119) volatile __LCDD09bits_t LCDD09bits;

#define _LCDD09_SEG08           0x01
#define _LCDD09_SEG09           0x02
#define _LCDD09_SEG10           0x04
#define _LCDD09_SEG11           0x08
#define _LCDD09_SEG12           0x10
#define _LCDD09_SEG13           0x20
#define _LCDD09_SEG14           0x40
#define _LCDD09_SEG15           0x80

//==============================================================================


//==============================================================================
//        LCDD10 Bits

extern __at(0x011A) __sfr LCDD10;

typedef struct
  {
  unsigned SEG16                : 1;
  unsigned SEG17                : 1;
  unsigned SEG18                : 1;
  unsigned SEG19                : 1;
  unsigned SEG20                : 1;
  unsigned SEG21                : 1;
  unsigned SEG22                : 1;
  unsigned SEG23                : 1;
  } __LCDD10bits_t;

extern __at(0x011A) volatile __LCDD10bits_t LCDD10bits;

#define _LCDD10_SEG16           0x01
#define _LCDD10_SEG17           0x02
#define _LCDD10_SEG18           0x04
#define _LCDD10_SEG19           0x08
#define _LCDD10_SEG20           0x10
#define _LCDD10_SEG21           0x20
#define _LCDD10_SEG22           0x40
#define _LCDD10_SEG23           0x80

//==============================================================================


//==============================================================================
//        LCDD11 Bits

extern __at(0x011B) __sfr LCDD11;

typedef struct
  {
  unsigned SEG24                : 1;
  unsigned SEG25                : 1;
  unsigned SEG26                : 1;
  unsigned SEG27                : 1;
  unsigned SEG28                : 1;
  unsigned SEG29                : 1;
  unsigned SEG30                : 1;
  unsigned SEG31                : 1;
  } __LCDD11bits_t;

