OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c926.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define PCFG0                   ADCON1bits.PCFG0                // bit 0
#define PCFG1                   ADCON1bits.PCFG1                // bit 1
#define PCFG2                   ADCON1bits.PCFG2                // bit 2
#define PCFG3                   ADCON1bits.PCFG3                // bit 3
#define ADFM                    ADCON1bits.ADFM                 // bit 7

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define CCP1Y                   CCP1CONbits.CCP1Y               // bit 4
#define CCP1X                   CCP1CONbits.CCP1X               // bit 5

#define RBIF                    INTCONbits.RBIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define RBIE                    INTCONbits.RBIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define LMUX0                   LCDCONbits.LMUX0                // bit 0
#define LMUX1                   LCDCONbits.LMUX1                // bit 1
#define CS0                     LCDCONbits.CS0                  // bit 2
#define CS1                     LCDCONbits.CS1                  // bit 3
#define VGEN                    LCDCONbits.VGEN                 // bit 4, shadows bit in LCDCONbits
#define BIAS                    LCDCONbits.BIAS                 // bit 4, shadows bit in LCDCONbits
#define WERR                    LCDCONbits.WERR                 // bit 5
#define SLPEN                   LCDCONbits.SLPEN                // bit 6
#define LCDEN                   LCDCONbits.LCDEN                // bit 7

#define SEG00                   LCDD00bits.SEG00                // bit 0
#define SEG01                   LCDD00bits.SEG01                // bit 1
#define SEG02                   LCDD00bits.SEG02                // bit 2
#define SEG03                   LCDD00bits.SEG03                // bit 3
#define SEG04                   LCDD00bits.SEG04                // bit 4
#define SEG05                   LCDD00bits.SEG05                // bit 5
#define SEG06                   LCDD00bits.SEG06                // bit 6
#define SEG07                   LCDD00bits.SEG07                // bit 7

#define SEG08                   LCDD01bits.SEG08                // bit 0
#define SEG09                   LCDD01bits.SEG09                // bit 1
#define SEG10                   LCDD01bits.SEG10                // bit 2
#define SEG11                   LCDD01bits.SEG11                // bit 3
#define SEG12                   LCDD01bits.SEG12                // bit 4
#define SEG13                   LCDD01bits.SEG13                // bit 5
#define SEG14                   LCDD01bits.SEG14                // bit 6
#define SEG15                   LCDD01bits.SEG15                // bit 7

#define SEG16                   LCDD02bits.SEG16                // bit 0
#define SEG17                   LCDD02bits.SEG17                // bit 1
#define SEG18                   LCDD02bits.SEG18                // bit 2
#define SEG19                   LCDD02bits.SEG19                // bit 3
#define SEG20                   LCDD02bits.SEG20                // bit 4
#define SEG21                   LCDD02bits.SEG21                // bit 5
#define SEG22                   LCDD02bits.SEG22                // bit 6
#define SEG23                   LCDD02bits.SEG23                // bit 7

#define SEG24                   LCDD03bits.SEG24                // bit 0
#define SEG25                   LCDD03bits.SEG25                // bit 1
#define SEG26                   LCDD03bits.SEG26                // bit 2
#define SEG27                   LCDD03bits.SEG27                // bit 3
#define SEG28                   LCDD03bits.SEG28                // bit 4
#define SEG29                   LCDD03bits.SEG29                // bit 5
#define SEG30                   LCDD03bits.SEG30                // bit 6
#define SEG31                   LCDD03bits.SEG31                // bit 7

#define LP0                     LCDPSbits.LP0                   // bit 0
#define LP1                     LCDPSbits.LP1                   // bit 1
#define LP2                     LCDPSbits.LP2                   // bit 2
#define LP3                     LCDPSbits.LP3                   // bit 3

#define SE0                     LCDSEbits.SE0                   // bit 0
#define SE5                     LCDSEbits.SE5                   // bit 1
#define SE9                     LCDSEbits.SE9                   // bit 2
#define SE12                    LCDSEbits.SE12                  // bit 3
#define SE16                    LCDSEbits.SE16                  // bit 4
#define SE20                    LCDSEbits.SE20                  // bit 5
#define SE27                    LCDSEbits.SE27                  // bit 6
#define SE29                    LCDSEbits.SE29                  // bit 7

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RBPU                OPTION_REGbits.NOT_RBPU         // bit 7

